foamPipe/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1.0;

vertices
(
	(0 0.2 0.2)		//0
    (0 -0.2 0.2)     	//1
	(0 -0.2 -0.2) 	//2
	(0 0.2 -0.2) 		//3
	(0 0.35355 0.35355)		//4
	(0 -0.35355 0.35355)		//5
	(0 -0.35355 -0.35355)	//6
    (0 0.35355 -0.35355)     //7
		
	(5 0.2 0.2)		//8
    (5 -0.2 0.2)     	//9
	(5 -0.2 -0.2) 	//10
	(5 0.2 -0.2) 		//11
	(5 0.35355 0.35355)		//12
	(5 -0.35355 0.35355)		//13
	(5 -0.35355 -0.35355)	//14
    (5 0.35355 -0.35355)     //15
		
);

blocks
(
    hex (3 11 8 0 2 10 9 1) (10 10 10) simpleGrading (1 1 1)
    hex (0 8 12 4 1 9 13 5) (10 10 10) simpleGrading (1 0.08333333 1)
	hex (2 10 9 1 6 14 13 5) (10 10 10) simpleGrading (1 1 0.08333333)
	hex (7 15 11 3 6 14 10 2) (10 10 10) simpleGrading (1 12 1)
	hex (7 15 12 4 3 11 8 0) (10 10 10) simpleGrading (1 1 12)
);

edges
(
	arc 4 5 (0 0 0.5)
	arc 5 6 (0 -0.5 0)
	arc 6 7 (0 0 -0.5)
	arc 4 7 (0 0.5 0)
	
	arc 12 13 (5 0 0.5)
	arc 13 14 (5 -0.5 0)
	arc 14 15 (5 0 -0.5)
	arc 12 15 (5 0.5 0)

	arc 0 1 (0 0 0.23)
	arc 1 2 (0 -0.23 0)
	arc 2 3 (0 0 -0.23)
	arc 0 3 (0 0.23 0)
	arc 8 9 (5 0 0.23)
	arc 9 10 (5 -0.23 0)
	arc 10 11 (5 0 -0.23)
	arc 11 8 (5 0.23 0)
	
);

boundary
(
    wall
    {
        type wall;
        faces
        (
	   	(4 12 13 5)
		(5 13 14 6)
		(6 14 15 7)
		(7 15 12 4)
        );
    }

    inlet
    {
        type patch;
		//neighbourPatch outlet;
        faces
        (
		(0 1 2 3)
		(0 4 5 1)
		(1 5 6 2)
		(2 6 7 3)
		(3 7 4 0)
        );
    }

    outlet
    {
        type patch;
		//neighbourPatch inlet;
        faces
        (
        (8 9 10 11)
		(8 12 13 9)
		(9 13 14 10)
		(10 14 15 11)
		(11 15 12 8)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
